INSERT INTO "AUTHOR" ("ID", "BIOGRAPHY", "FIRST_NAME", "MIDDLE_NAME", "LAST_NAME")
VALUES
  (1, 'Народився в Моринцях', 'Тарас', 'Григорович', 'Шевченко'),
  (2, 'Народився в Нагуєвичах', 'Іван', 'Якович', 'Франко');

INSERT INTO "BOOK" ("ID", "DESCRIPTION", "TITLE") VALUES
  (1, 'Шевченків Кобзар', 'Кобзар'),
  (2, 'Лис Микита', 'Фарбований лис');

INSERT INTO "BOOK_AUTHOR" ("BOOK_ID", "AUTHOR_ID") VALUES
  (1, 1),
  (2, 2);

INSERT INTO "CATEGORY" ("ID", "NAME", "PARENT_ID") VALUES
  (1, 'Українська', NULL),
  (2, 'Зарубіжна', NULL),
  (3, 'Класика', 1),
  (4, 'Сучасна', 1),
  (5, 'Класика', 2),
  (6, 'Сучасна', 2),
  (7, 'Дитяча', 3),
  (8, 'Дитяча', 4),
  (9, 'Дитача', 5),
  (10, 'Дитяча', 6),
  (11, 'Фантастика', 3),
  (12, 'Фантастика', 4),
  (13, 'Фантастика', 5),
  (14, 'Фантастика', 6),
  (16, 'Проза', 3),
  (17, 'Для дорослих', 4),
  (18, 'Для дорослих', 6),
  (19, 'Містика', 3),
  (20, 'Поезія', 3),
  (21, 'Автобіграфії', 6);

INSERT INTO "BOOK_CATEGORY" ("BOOK_ID", "CATEGORY_ID") VALUES
  (1, 20),
  (2, 9);

INSERT INTO "TAG" ("ID", "TITLE") VALUES
  (1, 'казки'),
  (2, 'лірика'),
  (3, 'про_тварин'),
  (4, 'Шевченко');

INSERT INTO "BOOK_TAG" ("BOOK_ID", "TAG_ID") VALUES
  (1, 2),
  (1, 4),
  (2, 1),
  (2, 3);

